app/controllers/posts_controller.rb

  def index
    @posts = if params[:q]
               Post.search(params[:q]).records
---
SELECT "posts".* FROM "posts"